import type { IStaticTopChartAnimes } from "#/static-but-it-is-typescript/internal-statics";

export const topChartAnimesStaticData: IStaticTopChartAnimes[] = [
    {
        title: "Клинок, рассекающий демонов: Бесконечный замок",
        shikimori_id: 59192,
        cover: "59192.jpg",
        description:
            "Родоначальник демонов Кибуцудзи Мудзан настолько силён и хитёр, что всё это время успешно ускользал от охотников, с каждым годом становясь всё сильней и неуязвимей. Несмотря на это, глава клана охотников Кагая Убуясики верит, что именно его поколение столпов сможет убить Мудзана. Ради этого столпы постоянно улучшают свои боевые навыки, ради этого они устроили рядовым членами организации адские тренировки. Однако передышка, когда демоны затаились, оказалась недолгой. Тренировки со столпами завершились. Пришла пора доказать, что изнуряющие занятия не прошли даром, и на деле продемонстрировать мощь охотников, годами мечтающих о том, чтобы извести зло на корню.",
    },
    {
        title: "Дандадан 2",
        shikimori_id: 60543,
        cover: "60543.jpg",
        description:
            "Старшеклассница Момо верит в привидений. Однажды она знакомится с парнем, который убеждён в существовании инопланетян. Они начинают спорить, пытаясь навязать друг другу свою точку зрения, и решают посетить оккультные места. Выясняется, что оба были правы.",
    },
    {
        title: "Дандадан",
        shikimori_id: 57334,
        cover: "57334.jpg",
        description:
            "Старшеклассница Момо верит в привидений. Однажды она знакомится с парнем, который убеждён в существовании инопланетян. Они начинают спорить, пытаясь навязать друг другу свою точку зрения, и решают посетить оккультные места. Выясняется, что оба были правы.",
    },
    {
        title: "Иногда Аля внезапно кокетничает по-русски",
        shikimori_id: 54744,
        cover: "54744.jpg",
        description:
            "Масатика Кудзэ учится в престижной Академии Сэирэи, в которой учатся лучшие школьники Японии. Его одноклассница Аля — наполовину русская, наполовину японка. Аля умна, красива и обладает жёстким характером. Масатика периодически прогуливает занятия и не заинтересован в общении с Алей, но однажды она начинает кокетничать с ним по-русски, даже не подозревая, что парень знает русский язык на уровне носителя.",
    },
    {
        title: "Моя подруга — демон",
        shikimori_id: 58449,
        cover: "58449.jpg",
        description:
            "Школьник Хигари изо всех сил пытается завести друзей. Его жизнь принимает неожиданный оборот, когда однажды летним днем он встречает демоницу Цумуги, которая пытается найти маму в мире людей.",
    },
    {
        title: "Металлическая Руж",
        shikimori_id: 54794,
        cover: "54794.jpg",
        description:
            "Будущее. Победив инопланетян с помощью боевых андроидов неанов, человечество колонизирует Марс, и наступает долгожданный мир. Поскольку боевые функции неанов становятся не нужны, их превращают в рабочих, и они становятся гражданами второго сорта по сравнению с людьми. Нуждаясь в ежедневной дозе специального наркотического нектара для поддержания жизнедеятельности, андроиды полностью зависят от своих хозяев-людей. Однако среди андроидов существует особый вид — протоны, способные трансформироваться в специальный экзоскелет со сверхчеловеческими способностями. К этой группе принадлежит Руж Редстар, которая работает под прикрытием в правительственной организации и вместе с напарницей-человеком Наоми Ортман занимается расследованием преступлений, связанных с андроидами.",
    },
    {
        title: "Девчонки с Хоккайдо чудо как милы",
        shikimori_id: 53421,
        cover: "53421.jpg",
        description:
            "Цубасу немалое впечатление и заставили промёрзнуть до костей. Но больше всего парня поразила не жуткая холодрыга, а девушка, которую он встретил посреди заснеженного пейзажа. По меркам Цубасы она была одета отнюдь не по погоде: лёгкая куртка нараспашку, небрежно повязанный шарф и короткая юбка. Пугало также отсутствие головного убора и колгот. От одного вида голых ног с покрасневшими от мороза коленками парня пробивал дикий озноб. При знакомстве оказалось, что морозостойкую девушку с Хоккайдо зовут Минами Фуюки, и она не просто досанко (человек, живущий на Хоккайдо), но и гяру, поэтому одета так легко. Вдобавок Цубаса и Минами теперь будут учиться в одной школе и видеться чаще, и в скором времени красные от мороза щеки и милый носик девушки поселят в сердце парня твёрдую уверенность в том, что именно досанко-гяру чудо как милы!",
    },
    {
        title: "Великая небесная стена",
        shikimori_id: 53393,
        cover: "53393.jpg",
        description:
            "Из-за неизвестного катаклизма вся человеческая цивилизация пришла в упадок. Те немногие, кому посчастливилось остаться в живых, обречены на суровое существование в реалиях постапокалипсиса со всеми вытекающими нехваткой воды, продовольствия, энергии и всех остальных благ, которые в один момент канули в небытие. И как вишенка на торте — монстры, появившиеся после катастрофы, для которых единственная пища — это человек. Но и в таких тяжёлых условиях всё ещё можно жить и радоваться жизни. Молодой парень Мару и его телохранитель Кируко путешествуют по бывшей Японии с великой целью найти Рай.В это же время группа детей нашли убежище в стенах загадочного закрытого учреждения. Здесь, под заботливой опекой защитников, они растут в относительной безопасности. Они окружены заботой и любовью, могут свободно учиться и играть, однако о том, что находится за стенами, им известно лишь по рассказам взрослых. Конечно, рано или поздно у детей пробуждается неугомонное любопытство, и их душами начинает овладевать томительная жажда познаний.В этой новой страшной реальности переплетаются судьбы и мечты, а тени прошлого и проблески будущего танцуют в вихре загадок. Каждый здесь не только судорожно пытается выжить, но и найти свой ответ на вопрос зачем ему вообще жить.",
    },
    {
        title: "Магическая битва (1 сезон)",
        shikimori_id: 40748,
        cover: "40748.jpg",
        description:
            "Действие аниме происходит в мире, где люди оказались вовсе не последним звеном в пищевой цепи, и любой ничего не подозревающий обыватель при должной доле невезения может оказаться съеденным демонами, которые воплощают собой негативные человеческие эмоции. Таких созданий называют проклятиями. Пускай люди в большинстве своём не догадываются о существовании проклятий, те имеют уже давнюю историю, одним из эпизодов которой являются деяния легендарного демона Сукуны Рёмэна, которого с большим трудом удалось одолеть. Его тело было поделено на двадцать частей, которые оказались разбросаны по миру. Если найдётся некто, кто поглотит все фрагменты его плоти, то он обретёт мощь, способную уничтожить современную цивилизацию. Вот такая сложилась ситуация в мире, где в полном неведении о нависшей над человечеством угрозе проживает старшеклассник Юдзи Итадори. У Юдзи совершенно иные заботы он каждый день навещает дедушку в больнице и отбрыкивается от спортивных кружков, которые мечтают заполучить его из-за выдающейся физической силы и выносливости. Юдзи предпочёл вступить в клуб оккультных наук, с которого и начались все неприятности, когда в руки членов клуба попал таинственный предмет, на который наложено проклятье. Не долго думая, школьники разбили запечатывающее заклинание и выпустили на свет ужасные силы.",
    },
    {
        shikimori_id: 34566,
        cover: "34566.jpg",
        title: "Боруто: Новое поколение Наруто",
        description:
            "Наруто Узумаки был юным задиристым синоби, ходячим магнитом для неприятностей. Он прошёл долгий путь, достигнув того, чего так яростно желал — стал Хокагэ, сильнейшим ниндзя Деревни Листвы, увековечив себя в истории всего мира. Однако эта история не о нём.С тех пор прошло много времени, и мир сильно изменился. Вместе с миром и спокойствием в Коноху пришли современные технологии — телевидение, небоскрёбы, кондиционеры, поезда и многое другое. Однако синоби никуда не делись, и их жизнь также сильно изменилась. Сын седьмого Хокагэ Деревни Листвы — Боруто поступает в академию ниндзя, чтобы изучить пути синоби. Он унаследовал от своего отца буйный, шальной характер, однако не намерен идти по его стопам. Другие ученики уже готовы заклеймить его «сынком Хокагэ», но мальчик непременно докажет всем, что это не так!Боруто и его друзьям предстоит расследовать серию загадочных событий, происходящих в деревне. Как ветер, проносящийся между листвы, он прокладывает путь к сердцу каждого человека — его история начинается!",
    },
    {
        shikimori_id: 16870,
        cover: "16870.jpg",
        title: "Наруто: Последний фильм",
        description:
            "Спустя 2 года после событий Четвертой Мировой Войны Луна, в которую давным-давно Рикудо Сэннин запечатал Гэдо Мазо, начинает приближаться к Земле, угрожая превратиться в метеор и уничтожить все живое. В это нелегкое время таинственный человек, обладающий бьякуганом, похищает сестру Хинаты, Ханаби. И теперь уже взрослые Наруто и его друзья отправляются, чтобы спасти Ханаби и принять участие в финальной битве, которая решит судьбу всего мира!",
    },
    {
        shikimori_id: 28755,
        cover: "28755.jpg",
        title: "Боруто (фильм)",
        description:
            "Боруто Узумаки — сын Наруто Узумаки , героя Скрытого Листа и седьмого Хокагэ. Главный герой сей истории весьма одарён, но ненавидит работу Наруто и поэтому считает его неважным отцом. Боруто считает своего отца героем, и в его сердце возникает желание превзойти героический путь отца, и лучшей идеей для этого становится намерение стать учеником человека, который знал его отца с ранних лет и являлся одновременно соперником и лучшим другом. Но что думает об этом сам Саскэ Учиха ? В то время, как команда Боруто обзаведётся своим сэнсэем, Боруто будет называть учителем Саскэ. Итак, наступает новая эпоха для жизни нового поколения синоби.",
    },
    {
        shikimori_id: 1735,
        cover: "1735.jpg",
        title: "Наруто: Ураганные хроники (2 сезон)",
        description:
            "«Ураганные хроники» продолжают историю о приключениях юного ниндзя Наруто Узумаки и его друзей. С начала серии проходит три года, герои взрослеют, набираются жизненного опыта и совершенствуют свои навыки.Наруто возвращается в Деревню Скрытой Листвы, и команда, ранее состоящая из него, Саскэ и Сакуры , переформировывается. Место Саскэ в ней занимает молодой ниндзя по имени Сай, и вместе они берут название «Команда Какаши».Но безоблачная жизнь длится недолго. В Конохе вновь вспыхивают старые раздоры, оставшиеся после первых Хокагэ. Лидер Акацуки мечтает о мировом господстве, а в Деревне Песка всплывают старые тайны.Вскоре весь мир ждут серьёзные испытания и сильнейшие потрясения.",
    },
    {
        shikimori_id: 20,
        cover: "20.jpg",
        title: "Наруто. 1 сезон",
        description:
            "«Это мой путь ниндзя!» В день рождения Наруто Узумаки на деревню под названием Коноха напал легендарный демон, Девятихвостый лис. Четвёртый Хокагэ ценой своей жизни спас деревню, запечатав демона в новорождённом Наруто, неосознанно обрекая его на жизнь в ненависти односельчан.Несмотря на недостаток таланта во многих областях ниндзюцу, неусидчивость и задиристость, у Наруто есть мечта — стать Хокагэ, сильнейшим ниндзя в деревне. Желая признания, которого не получал, он упорно работает и тренируется вместе со своими напарниками, Саскэ Учихой и Сакурой Харуно , а также со своим наставником Какаши Хатакэ. Ему и его напарникам придётся пройти через многое по пути к своим заветным мечтам сражения, любовь, дружба, предательство, жажда силы...",
    },
    {
        shikimori_id: 52588,
        cover: "52588.jpg",
        title: "Кайдзю номер восемь",
        description:
            "Уже несколько десятилетий Японию терроризируют громадные монстры, которые получили название кайдзю. Они появляются из ниоткуда и не только пожирают людей, но и разрушают целые города. Однако за прошедшие годы наука и техника продвинулись далеко вперёд. Для защиты граждан были созданы элитные войска, которые денно и нощно рискуют своими жизнями ради спасения людей. Благодаря этому противостоять угрозе удаётся довольно успешно. Свой вклад в поддержание мирных будней вносят и специальные клининговые отряды, очищающие улицы от туш убитых монстров.32-летний профессиональный уборщик Кафка Хибино, когда-то мечтавший вступить в ряды защитников, после нескольких провалов на отборе опустил руки и убедил себя, что его всё устраивает. Кто-то ведь должен и чистоту наводить, верно? «Неверно», — возражает Кафке новенький стажёр Рено Итикава и сообщает коллеге, что возраст для вступления в боевой отряд недавно повысили до 33-х лет. Получается, у Кафки есть один-единственный распоследний шанс стать защитником людей. Шанс-то есть, а вот ни силёнок, ни здоровья в наличии уже нет. Но главное — найти в себе решимость!«Нашёл!» — сообщил Кафке мелкий летающий кайдзю и залез к нему в рот. Нетренированный Кафка превратился в могучего человекоподобного кайдзю. На которого тотчас начал охоту защитный отряд. Кафка оказался перед дилеммой с одной стороны, хочет спастись, сбежав от отряда, с другой — хочет стать его частью.",
    },
    {
        shikimori_id: 51179,
        cover: "51179.jpg",
        title: "Реинкарнация безработного (2 сезон, часть 1)",
        description:
            "После долгих приключений и множества испытаний друзья вернулись домой, однако конец пути оказался только его началом. После того как Эрис покинула Рудеуса и отправилась в собственное странствие, он, разбитый одиночеством, двинулся на Север с одной целью — найти свою мать.Рудеус потерял всякий интерес к жизни, однако новые друзья помогают ему вернуть радость бытия. Кроме того, он получил приглашения в Магическую академию, куда он когда-то собирался поступать! Похоже, Рудеусу рано уходить от дел, ведь впереди множество великих событий и свершений!",
    },
    {
        shikimori_id: 38000,
        cover: "38000.jpg",
        title: "Клинок, рассекающий демонов (1 сезон)",
        description:
            "Действие происходит в эпоху Тайсё. Ещё с древних времён ходят слухи о том, что в лесу обитают человекоподобные демоны, которые питаются людьми и ходят по ночам, ища новую жертву. Но... это же просто легенда, ведь так?..Тандзиро Камадо — старший сын в семье, потерявший своего отца и взявший на себя заботу о своих родных. Однажды он уходит в соседний город, чтобы продать древесный уголь. Вернувшись утром, парень обнаруживает перед собой страшную картину вся родня была зверски убита, а единственной выжившей является Нэдзуко — обращённая в демона, но пока не потерявшая всю человечность младшая сестра.С этого момента для Тандзиро и Нэдзуко начинается долгое и опасное путешествие, в котором мальчик намерен разыскать убийцу и узнать способ исцеления для своей сестры. Но в состоянии ли дети преодолеть все трудности и вернуться домой?",
    },
    {
        shikimori_id: 33352,
        cover: "33352.jpg",
        title: "Вайолет Эвергарден",
        description:
            "Вайолет Эвергарден, молодая девушка, чья жизнь — не что иное, как война, послушно служит под командованием майора Гилберта Бугенвиллеи из армии Ляйденшафтлиха.После серьёзных увечий, оставивших её без рук и разделивших с Гилбертом, она покинула поле боя и была взята под опеку бывшим командующим армии Клаудией Ходжинсом , который после окончания войны основал почтовую службу «C-H» в крупном портовом городе Ляйден. Эта компания осуществляет регулярные почтовые пересылки и предоставляет услуги «автозапоминающих кукол» — талантливых девушек, в чьи обязанности входит написание писем и корректировка текста для большей части неграмотного населения города.В конечном итоге, тронутая работой автозапоминающих кукол, Вайолет решает присоединиться к команде, чтобы узнать судьбу майора Гилберта и смысл последних слов, сказанных им «Я люблю тебя».",
    },
    {
        shikimori_id: 51180,
        cover: "51180.jpg",
        title: "Добро пожаловать в класс превосходства (3 сезон)",
        description:
            "Зимние каникулы пролетели в один миг, и класс 1-D с новыми силами начал третий семестр. Не успели студенты влиться в учебный процесс, как их внезапно собрали и загрузили в автобусы. Учащиеся первого, второго и третьего годов отправились в школьный лагерь, где по прибытии их ожидал очередной специальный экзамен. Всех перемешали в группы, так что враги стали временными союзниками, а союзники — врагами. Каждого, кто не справится и подведёт команду, ждёт отчисление, что в будущем повлечёт за собой множество неблагоприятных последствий для всего класса. Сейчас единственная цель класса D — получить лучший из возможных результатов и не допустить исключения одноклассников из школы. Что предпримет Киётака? Займёт ли предпочитаемую им нейтральную сторону или же вмешается и поможет ребятам в этой игре на выбывание?",
    },
    {
        shikimori_id: 52299,
        cover: "52299.jpg",
        title: "Поднятие уровня в одиночку",
        description:
            "Десять лет назад по всему миру стали открываться некие «врата», ведущие в подземелья с монстрами, противостоять которым оказалось не под силу даже военным. Однако если успеть вовремя победить босса подземелья, то врата пропадут, не открывшись, и мирные люди не пострадают. Сразиться с боссом способны только избранные — люди, получившие особые силы, чтобы бороться с чудовищами. Таких людей назвали «охотниками». Вот только способности, которые они получают, крайне различны как по функционалу, так и по мощи.Например, охотник Сон Джину относится всего лишь к рангу Е хоть и сильнее обычного человека, он в разы слабее любого самого слабого охотника. Он не в состоянии справиться с самым ничтожным монстром, поэтому вынужден ходить в подземелье в составе большой группы. Напарники убивают всю мелочь, так что у Сон Джину нет возможности хорошо заработать на охоте. Нет денег, а значит нет финансов на улучшение снаряжения. В общем, замкнутый круг. Однако он продолжает заниматься «охотой», чтобы оплатить больничные счета матери, которая находится в коме.Всё изменилось, когда, отправившись в очередное низкоранговое подземелье, они с командой наткнулись на очень странную вещь — ещё одно подземелье, которое оказалось внутри того, что они уже очистили. Решив рискнуть, они вошли внутрь.",
    },
    {
        shikimori_id: 52991,
        cover: "52991.jpg",
        title: "Провожающая в последний путь Фрирен",
        description:
            "Одержав победу над Королём демонов, отряд героя Химмеля вернулся домой. Приключение, растянувшееся на десятилетие, подошло к завершению. Волшебница-эльф Фрирен и её отважные товарищи принесли людям мир и разошлись в разные стороны, чтобы спокойно прожить остаток жизни. Однако не всех членов отряда ждёт одинаковая участь. Для эльфов время течёт иначе, поэтому Фрирен вынужденно становится свидетелем того, как её спутники один за другим постепенно уходят из жизни. Девушка осознала, что годы, проведённые в отряде героя, пронеслись в один миг, как падающая звезда в бескрайнем космосе её жизни, и столкнулась с сожалениями об упущенных возможностях. Сможет ли она смириться со смертью друзей и понять, что значит жизнь для окружающих её людей? Фрирен начинает новое путешествие, чтобы найти ответ.",
    },
];
