import type { IStaticDescribeGenres } from "#/constants/anime-genres/internal-statics";
export type genresType = {
    russian_name: string;
    link_url: `/genres/${string}`;
};
export const DescribeGenresStaticData: IStaticDescribeGenres[] = [
    {
        // english_name: "Slice of Life",
        russian_name: "Повседневность",
        description: "жанр, повествующий о жизни простых обывателей.",
    },
    {
        // english_name: "Romance",
        russian_name: "Романтика",
        description: "жанр, повествующий о любовных переживаниях",
    },
    {
        // english_name: "Comedy",
        russian_name: "Комедия",
        description: "жанр, характеризующийся наличием юмористических и сатирических сцен.",
    },
    {
        // english_name: "Drama",
        russian_name: "Драма",
        description: "жанр, повествующий о частной жизни человека и его личном конфликте с обществом.",
    },
    {
        //     english_name: "Mystery",
        russian_name: "Детектив",
        description:
            "жанр, описывающий исследование и раскрытие загадочного происшествия (обычно преступления) или серии происшествий.",
    },
    {
        // english_name: "Action",
        russian_name: "Экшен",
        description: "жанр, изобилующий сценами насилия различного рода: драки, перестрелки, погони и тому подобное.",
    },

    {
        // english_name: "Ecchi",
        russian_name: "Этти",
        description:
            "жанр аниме, ключевой особенностью которого является показ эротических сцен. В отличие от хентай этти не показывает сексуальные отношения напрямую, фансервис — использование различных намёков на эротику, например, показ персонажей (как правило женского пола, поскольку целевой аудиторией этти являются юноши) в двусмысленных позах, использование таких ракурсов обзора, при которых зритель видит нижнее бельё персонажа (панцушот), акцент на грудь и ягодицы, которые часто изображаются в преувеличенном виде, различные неловкие ситуации, в которые попадает мужской персонаж (случайное появление в женской бане или раздевалке, падение на девушку и т. п.).",
    },
    {
        // english_name: "Hentai",
        russian_name: "Хентай",
        description:
            "жанр аниме, в котором содержатся эротические или порнографические сцены. Имеет возрастное ограничение 18+.",
    },
    {
        // english_name: "Yaoi",
        russian_name: "Яой",
        description: "жанр аниме, описывающий мужские гомосексуальные отношения, обычно предназначен для женщин",
    },

    {
        // english_name: "Yuri",
        russian_name: "Юри",
        description: "жанр аниме, описывающий женские лесбийские отношения, обычно предназначен для мужчин и парней.",
    },

    {
        // english_name: "Fantasy",/
        russian_name: "Фэнтези",
        description:
            "произведение, рассказывающее о мирах, которыми правит не технология, а «меч и магия». В фэнтези часто фигурируют не только люди, но и разнообразные мифологические существа — эльфы, гномы, драконы, оборотни, люди-кошки, а также боги и демоны.",
    },
    {
        // english_name: "School",
        russian_name: "Школа",
        description:
            "жанр в аниме, который сосредотачивается на школьной жизни подростков. Часто такие аниме происходят в средней или старшей школе и включают в себя различные аспекты повседневной жизни учеников: учёбу, дружбу, первую любовь, спорт, клубную деятельность и иногда даже сверхъестественные элементы.",
    },

    {
        // english_name: "Seinen",
        russian_name: "Сэйнэн",
        description:
            "аниме для взрослых мужчин (от 18 до 25-40 лет). Характерными чертами этого жанра являются элементы психологии, сатиры, эротики, больше внимания уделяется развитию персонажей. Сэйнэн иногда путают с сёдзё, однако произведения в этом жанре реалистичнее и мрачнее (Maison Ikkoku, Ghost in the Shell), а сюжет не завязан на романтической истории, хотя любовная история может присутствовать (Monster, Berserk). В редких случаях аниме или манга в жанре сэйнэн нацелены на бизнесменов в возрасте более 35-40 лет.",
    },
    {
        // english_name: "Historical",
        russian_name: "Исторический",
        description:
            "жанр аниме, который рассказывает о прошлом. Они довольно точны в фактическом плане и могут помочь в изучении истории разных стран.",
    },
    {
        // english_name: "Parody",
        russian_name: "Пародия",
        description:
            "жанр, который использует элементы других произведений, будь то аниме, фильмы, книги или даже реальные события, для создания юмористического эффекта. Создатели пародий часто преувеличивают, высмеивают или пародируют определенные тропы, персонажей или сюжетные линии, чтобы вызвать смех у зрителей.",
    },
    {
        // english_name: "Harem",
        russian_name: "Гарем",
        description:
            'этот жанр характеризуется тем, что главный герой (обычно мужчина) оказывается окружённым несколькими персонажами противоположного пола, которые проявляют к нему романтический или сексуальный интерес. В традиционном гаремном аниме обычно центральный персонаж — мужчина, а остальные персонажи — женщины. Однако существует также поджанр "обратный гарем", где главный герой — женщина, окружённая несколькими мужчинами.',
    },
    {
        // english_name: "Josei",
        russian_name: "Дзёсей",
        description:
            "аниме для взрослых мужчин (от 18 до 25-40 лет). Характерными чертами этого жанра являются элементы психологии, сатиры, эротики, больше внимания уделяется развитию персонажей. Сэйнэн иногда путают с сёдзё, однако произведения в этом жанре реалистичнее и мрачнее (Maison Ikkoku, Ghost in the Shell), а сюжет не завязан на романтической истории, хотя любовная история может присутствовать (Monster, Berserk). В редких случаях аниме или манга в жанре сэйнэн нацелены на бизнесменов в возрасте более 35-40 лет.",
    },
    {
        // english_name: "Adventure",
        russian_name: "Приключения",
        description:
            'жанр, который фокусируется на путешествиях и экспедициях главных героев в различные фантастические или реальные миры. Такие сюжеты часто включают в себя поиски сокровищ, открытие неизведанных земель или попытки достичь труднодоступных целей. Герои сталкиваются с множеством препятствий, включая опасных врагов, загадочные существа и сложные загадки. Жанр "Приключения" часто включает элементы других жанров, таких как фэнтези, экшен, и драма, что делает его захватывающим и динамичным.',
    },
    {
        // english_name: "Samurai",
        russian_name: "Самураи",
        description: "историко-приключенческий жанр произведений о сражениях самураев и ниндзя.",
    },
    {
        // english_name: "Super Power",
        russian_name: "Супер сила",
        description:
            "жанр аниме, который фокусируется на персонажах, обладающих необычными или сверхъестественными способностями, которые значительно превосходят возможности обычных людей.",
    },
    {
        // english_name: "Military",
        russian_name: "Военное",
        description:
            "жанр аниме, который фокусируется на военных действиях, конфликтах и последствиях войны. Эти истории часто рассказывают о сражениях, стратегиях и жизни солдат, а также об их личных переживаниях в условиях войны. В таких аниме часто поднимаются темы героизма, товарищества, жертвенности и моральных дилемм, связанных с войной.",
    },
    {
        // english_name: "Supernatural",
        russian_name: "Сверхъестественное",
        description:
            "жанр в аниме, который охватывает произведения, в которых происходят события, выходящие за рамки обычных человеческих возможностей и законов природы. В этих аниме могут быть задействованы призраки, демоны, боги, магия, паранормальные явления и другие сверхъестественные элементы.",
    },
    {
        // english_name: "Thriller",
        russian_name: "Триллер",
        description:
            "жанр триллер фокусируется на создании напряженной и захватывающей атмосферы, используя элементы неопределенности, опасности и часто психологического напряжения.",
    },
    {
        // english_name: "Martial Arts",
        russian_name: "Боевые искусства",
        description:
            "жанр аниме, который фокусируется на физическом мастерстве персонажей, которые участвуют в боях, демонстрируя различные стили боевых искусств, такие как карате, кэндо, кунг-фу и другие. Основное внимание уделяется тренировкам, дисциплине и развитию навыков персонажей, а также их личностному росту через преодоление трудностей и сражения с сильными противниками. Часто в таких аниме присутствуют турниры, дуэли и эпические битвы, где герои применяют как традиционные, так и фантастические приемы.",
    },
    {
        // english_name: "Sci-Fi",
        russian_name: "Научная фантастика",
        description:
            "жанр аниме, действие которого связано с существованием и использованием техники, не существовавшей на момент создания этого аниме (межзвёздных космических кораблей, бластеров и т. д.) Обычно НФ-аниме излагает возможную историю будущего человечества, часто его сюжеты связаны с контактами с пришельцами.",
    },
    {
        // english_name: "Shounen ai",
        russian_name: "Сёнен-ай",
        description: "жанр аниме, описывающий любовь юноши к юноше. Отличается от яоя отсутствием откровенных сцен.",
    },
    {
        // english_name: "Work Life",
        russian_name: "Работа",
        description:
            "жанр аниме, который сосредотачивается на повседневной жизни персонажей в их рабочей среде, будь то офис, кафе, ресторан, магазин или даже уникальные рабочие места, такие как управление храмом или работа в зоопарке. Эти аниме часто показывают взаимодействие персонажей с коллегами, вызовы, связанные с их профессией, а также личный рост и развитие героев через их профессиональную деятельность.",
    },
    {
        // english_name: "Shounen",
        russian_name: "Сёнен",
        description:
            "аниме для старших мальчиков и юношей (с 12 до 16-18 лет). Основные признаки жанра: быстрое развитие и ярко выраженный динамизм сюжета (особенно в сравнении с сёдзё). Произведения содержат множество юмористических сцен, основываются на темах крепкой мужской дружбы, любого вида соперничества в жизни, спорте или в боевых искусствах (например, Dragon Ball Z, Rurouni Kenshin). Девушки и женщины в сёнэн аниме часто изображаются преувеличенно красивыми и сексуальными, такое гипертрофирование служит для наилучшего проявления мужественности главных героев. Для юношей более старшего возраста (например, студентов) существует отдельный жанр «сэйнэн».",
    },
    {
        // english_name: "Psychological",
        russian_name: "Психологическое",
        description:
            "жанр аниме, описывающий злоключения человеческой души. Попадая в тяжелые ситуации, герои таких аниме переживают сложные и непредсказуемые психологические изменения.",
    },
    {
        // english_name: "Music",
        russian_name: "Музыка",
        description:
            "жанр аниме, который обычно сосредотачивается на музыкальной индустрии, выступлениях, развитии музыкальных талантов и отношениях между персонажами, связанными с музыкой. Эти аниме часто рассказывают истории о становлении музыкальных групп, индивидуальных исполнителях, их борьбе с трудностями на пути к успеху и достижении мечты через музыку. ",
    },
    {
        // english_name: "Dementia",
        russian_name: "Жестокость",
        description: "",
        // "аниме этого жанра обычно включает в себя сюжеты с интенсивным психологическим напряжением, хаосом, искаженными реальностями и персонажами, испытывающими крайние психические или эмоциональные состояния. В таких аниме часто изображаются сцены жестокости, кошмаров или иррационального поведения, что создает мрачную, пугающую или даже сюрреалистическую атмосферу. Эти аниме могут исследовать темы, связанные с психозом, страхами, внутренними демонами и разрушением личности.",
    },
    {
        // english_name: "Shoujo",
        russian_name: "Сёдзё",
        description:
            "аниме и манга для старших девочек и девушек (с 12 до 16-18 лет). В сюжете сёдзё аниме, как правило, присутствуют любовные отношения разной степени близости, в зависимости от возраста целевой аудитории, большое внимание уделяется развитию образов персонажей. ",
    },
    {
        // english_name: "Shoujo Ai",
        russian_name: "Сёдзё-ай",
        description:
            "жанр аниме, описывающий любовь девушки к девушке. Отличается от юри отсутствием откровенных сцен.",
    },
    {
        // english_name: "Sports",
        russian_name: "Спорт",
        description:
            "аниме этого жанра сосредоточено на истории, связанной с определенным видом спорта. Главные герои обычно стремятся достичь высоких результатов в своей дисциплине, преодолевая физические и психологические препятствия. Сюжеты часто включают тренировки, соревнования и развитие командного духа. Темы упорства, дружбы и личностного роста являются центральными. Это жанр, который вдохновляет зрителей на стремление к успеху через тяжелый труд и целеустремленность.",
    },
    {
        // english_name: "Mecha",
        russian_name: "Меха",
        description:
            "сложные механизмы, как правило, самодвижущиеся, не имеющие реальных прототипов. Обычно этим термином обозначают «гигантских боевых человекоподобных роботов», огромные человекоуправляемые боевые машины (прим. Реже — биологические.",
    },
    {
        // english_name: "Gourmet",
        russian_name: "Гурман",
        description:
            "жанр который посвящен теме еды, кулинарии и гастрономии. В таких аниме центральное место занимают блюда, кулинарные техники и культура приготовления пищи. Зрители могут насладиться красивыми сценами приготовления пищи, узнавать рецепты и погружаться в атмосферу любви к еде. Часто такие аниме также исследуют отношения между персонажами через призму кулинарии, добавляя элементы драмы, комедии или даже приключений.",
    },
    {
        // english_name: "Vampire",
        russian_name: "Вампиры",
        description:
            "аниме этого жанра часто включает элементы мистики, ужаса и сверхъестественного, сосредотачиваясь на истории о вампирах – существах, питающихся кровью. Эти аниме могут исследовать темы бессмертия, морали, борьбы между людьми и вампирами, а также романтику.",
    },
    {
        // english_name: "Erotica",
        russian_name: "Эротика",
        description:
            "аниме этого жанра включает в себя элементы сексуальности и романтики, часто с откровенными сценами или темами, которые фокусируются на отношениях между персонажами. Этот жанр может варьироваться от мягкой эротики, где акцент делается на обаяние и сексуальное напряжение, до более откровенных сюжетов, где сексуальные сцены играют важную роль. Тем не менее, стоит помнить, что в некоторых странах и на платформах могут существовать возрастные ограничения для просмотра контента в этом жанре.",
    },
    {
        // english_name: "Space",
        russian_name: "Космос",
        description:
            'Аниме этого жанра (также для жанра "Космическая фантастика") обычно включает сюжеты, связанные с космическими путешествиями, межзвездными войнами, исследованием новых планет, контактом с инопланетными цивилизациями или выживанием в условиях космоса. Это жанр, который часто сочетает элементы научной фантастики и приключений, а также иногда включает философские размышления о месте человечества во Вселенной.',
    },
    {
        // english_name: "Horror",
        russian_name: "Ужасы",
        description:
            "жанр аниме, который фокусируется на создание напряжения, страха и тревоги. В таких произведениях могут присутствовать сверхъестественные существа, монстры, демоны, призраки или психологический ужас, который раскрывается через мрачную атмосферу, загадочные события и напряженные сюжетные линии.",
    },
    {
        // english_name: "Kids",
        russian_name: "Детское (Кодомо)",
        description:
            "аниме, предназначенные для детей (до 12 лет). Отличительная особенность этого жанра — в его «детскости», отсутствует (иногда просто сильно упрощено) идейное наполнение. Кодомо обычно рисуется без проявлений жесткости и грубости, часто несёт развлекательный характер. ",
    },
    {
        // english_name: "Demons",
        russian_name: "Демоны",
        description:
            "жанр этого аниме обычно включает сюжеты, где центральными персонажами являются демоны или другие сверхъестественные существа, связанные с тьмой, потусторонним миром или злом. Часто такие аниме сочетают элементы хоррора, темной фэнтези, экшена и драмы. Персонажи могут сталкиваться с внутренними и внешними угрозами, связанными с демоническими силами, часто борясь за свою душу или за спасение мира.",
    },
    {
        // english_name: "Game",
        russian_name: "Игры",
        description:
            "жанр этого аниме сосредотачивается на персонажах, которые оказываются вовлечены в различные игры, будь то виртуальные, настольные или реальные, с высокими ставками. Эти игры могут быть связаны с выживанием, сражениями, стратегией или психологическим давлением. В таких аниме персонажи часто сталкиваются с моральными дилеммами, логическими задачами и необходимостью принимать сложные решения, которые могут повлиять на их судьбу и окружающий мир. Часто сюжет строится вокруг мира, где правила игры могут быть уникальными и отличаться от привычной реальности.",
    },
    {
        // english_name: "Police",
        russian_name: "Полиция",
        description:
            "аниме этого жанра фокусируется на истории и буднях сотрудников правоохранительных органов. В таких произведениях часто показываются расследования преступлений, борьба с преступным миром, юридические аспекты работы полиции и моральные дилеммы, с которыми сталкиваются герои. Атмосфера обычно напряженная, с элементами драмы, триллера и иногда мистики. Герои таких аниме могут быть как детективами, так и патрульными офицерами, работающими на передовой.",
    },
    {
        // english_name: "Cars",
        russian_name: "Машины",
        description:
            "аниме этого жанра, обычно фокусируется на автомобилях и гонках, а также на культуре, связанной с автомобилями. Этот жанр может включать истории о профессиональных гонщиках, уличных гонках, ремонте и тюнинге машин, а также о взаимодействии между людьми и их автомобилями.",
    },
    {
        // english_name: "Cars",
        russian_name: "Взрослые персонажи",
        description: "",
    },
    {
        description: "",
        russian_name: "Фантастика",
    },
    {
        description: "",
        russian_name: "Тайна",
    },
    {
        description: "",
        russian_name: "Питомцы",
    },
    {
        description: "",
        russian_name: "Авангард",
    },
];

export const uiNeededGenres: Omit<IStaticDescribeGenres, "description">[] = DescribeGenresStaticData.map((g) => {
    return {
        // english_name: g.english_name,
        russian_name: g.russian_name,
    };
});

export const uiNeededGenreLinks: genresType[] = uiNeededGenres.map((gen) => {
    return {
        russian_name: gen.russian_name,
        link_url: `/genres/${gen.russian_name}`,
    };
});
